# Add Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
MechanicalEquipmentSet..::..Add Method
MechanicalEquipmentSet Class See Also
---
Adds member element ids to the mechanical equipment set.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public void Add(
	ISet<ElementId> elemIds
)
```

Visual Basic
---
```text
Public Sub Add ( _
	elemIds As ISet(Of ElementId) _
)
```

Visual C++
---
```text
public:
void Add(
	ISet<ElementId^>^ elemIds
)
```

# ### Parameters
elemIds
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> Element ids to be added to the mechanical equipment set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The valid members must have the same classification and system. They cannot be a member of existing set. -or- These elements are serially connected with each other, or with one of the set members. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MechanicalEquipmentSet Class
Autodesk.Revit.DB.Mechanical Namespace